---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AllModelUrl
source: html/e643fe0d-0c25-0bed-0e91-8c32416da9f6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AllModelUrl Property

"URL"

## Syntax (C#)
```csharp
public static ForgeTypeId AllModelUrl { get; }
```